// Написать программу вычисления значения функции y = f(a)

void Print(){
    Console.WriteLine("Hello");
}
Print();
